Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: a 1-dimensional array containing only the unique elements of that Column.
fr: Retourne un tableau à 1D contenant seulement les éléments uniques de cette colonne.

source: 1 - $aArray is not an array or is an empty array.
fr: 1 - $aArray n'est pas un tableau ou est un tableau vide.

source: 3 - $iBase or $iCase contains an invalid value
fr: 3 - $iBase ou $iCase contient une valeur non valide

source: 4 - $iFlags contains an invalid value
fr: 4 - $iFlags contient une valeur non valide

source: 5 - $iColumn ouside array bounds
fr: 5 - $iColumn est en dehors des limites du tableau

source: Returns an array containing the unique strings.
fr: Retourne un tableau contenant les chaînes uniques.

source: If the parameter $iFlags is set to 1, the first element $aArrayRet[0] contains the number of strings returned.
fr: Si le paramètre $iFlags est mis à 1, le premier élément $aArrayRet[0] contient le nombre de chaînes renvoyées.

source: Create a 1-dimensional array that contains duplicate values.
fr: Créez un tableau 1D qui contient des valeurs en double.

source: Display the current array.
fr: Affiche le tableau initial.

source: Use default parameters to create a unique array.
fr: Utilise les paramètres par défaut pour créer un tableau sans doublon.

source: Display the unique array.
fr: Affiche le tableau sans doublon.

source: Use default parameters to create a unique array of the first column.
fr: Utilise les paramètres par défaut pour créer un tableau sans doublon sur la première colonne.

source: Create a unique array of the second column.
fr: Crée un tableau sans doublon à partir de la deuxième colonne.

source: Display a message if assertion fails
fr: Affiche un message si une assertion échoue

source: The condition (expression quoted) that must evaluate to true.
fr: La condition (expression entre quote) qui doit être évaluée à vraie.

source: If true, the script is aborted.
fr: Si vrai, le script est interrompu lorsque la condition est vraie.

source: The exit code to use if the script is aborted.
fr: Le code de sortie à utiliser si le script est interrompu.

source: Displays the line number where the assertion failed.
fr: Affiche le numéro de ligne où l'assertion a échoué.

source: If this value is not changed, then the default value will show the correct line.
fr: Si cette valeur n'est pas modifiée, la valeur par défaut affichera la ligne correcte.

source: Returns the result of the condition (Only valid when not exiting).
fr: Retourne le résultat de la condition (Valide uniquement lorsque le script n'est pas sorti).

source: @error and @extended are not destroyed on return.
fr: @error et @extended ne sont pas détruits lors du retour.

source: Creates a Color dialog box that enables the user to select a color
fr: Crée une boîte de dialogue Couleur qui permet à l'utilisateur de sélectionner une couleur

source: Determines return type, valid values:
fr: Détermine le type de retour, les valeurs valides sont:

source: 0 - COLORREF rgbcolor
fr: 0 - COLORREF couleur RGB

source: 1 - BGR hex
fr: 1 - BGR en hexadécimal

source: 2 - RGB hex
fr: 2 - RGB en hexadécimal

source: Default selected Color
fr: Couleur sélectionnée par défaut

source: Type of $iColorRef passed in, valid values:
fr: Type de $iColorRef passé, les valeurs valides sont:

source: Handle to the window that owns the dialog box
fr: Handle de la fenêtre qui est propriétaire de la boîte de dialogue

source: Color returned
fr: Retourne la couleur sélectionnée par l'utilisateur

source: convert COLORREF to RGB for this example
fr: convertir COLORREF RVB pour cet exemple

source: Creates a Font dialog box that enables the user to choose attributes for a logical font
fr: Crée une boîte de dialogue Police qui permet à l'utilisateur de choisir les attributs pour une police logique

source: Default font name
fr: Nom de la police par défaut

source: Pointsize of font
fr: Taille en points de la police

source: COLORREF rgbColors
fr: Couleur rgb COLORREF

source: Font Weight
fr: Graisse de la Police

source: Italic
fr: Italique

source: Underline
fr: Souligné

source: Strikethru
fr: Barré

source: an array in the following format:
fr: Retourne un tableau dans le format suivant:

source: [0] - contains the number of elements
fr: [0] - contient le nombre d'éléments du tableau

source: [1] - attributes = BitOR of italic:2, undeline:4, strikeout:8
fr: [1] - attributs = BitOR de italique:2, souligné:4, barré:8

source: [2] - fontname
fr: [2] - nom de la police

source: [3] - font size = point size
fr: [3] - taille de la police en points

source: [4] - font weight = = 0-1000
fr: [4] - graisse de la police de 0 à 1000

source: [5] - COLORREF rgbColors
fr: [5] - couleur rgb COLORREF

source: [6] - Hex BGR Color
fr: [6] - couleur BGR en hexadécimal

source: [7] - Hex RGB Color
fr: [7] - couleur RGB en hexadécimal

source: Removes a specified window from the chain of clipboard viewers
fr: Supprime une fenêtre spécifiée de la chaîne des vues du presse-papiers

source: Handle to the window to be removed from the chain.
fr: Handle de la fenêtre qui doit être retirée de la chaîne.

source: The handle must have been passed to the _ClipBoard_SetViewer() function.
fr: La handle doit avoir été passé à la fonction _ClipBoard_SetViewer().

source: Handle to the window that follows the $hRemove window in the clipboard viewer chain.
fr: Handle de la fenêtre qui suit la fenêtre $hRemove dans la chaîne des vues du presse-papiers.

source: This is the handle returned by _ClipBoard_SetViewer(), unless the sequence was changed in response to a $WM_CHANGECBCHAIN message.
fr: C'est le handle renvoyé par _ClipBoard_SetViewer() , à moins que la séquence ait été modifiée en réponse à un message $WM_CHANGECBCHAIN.

source: The window identified by $hNewNext replaces the $hRemove window in the chain.
fr: La fenêtre identifiée par $hNewNext remplace la fenêtre $hRemove dans la chaîne.

source: The _ClipBoard_SetViewer() function sends a $WM_CHANGECBCHAIN message to the first window in the clipboard viewer chain.
fr: La fonction _ClipBoard_SetViewer() envoie le message $WM_CHANGECBCHAIN à la première fenêtre de la chaîne des vues du presse-papiers.

source: See Also
fr: Voir aussi

source: Search ChangeClipboardChain in MSDN Library
fr: Consultez ChangeClipboardChain dans la Librairie MSDN.

source: Create GUI
fr: Crée une GUI

source: Initialize clipboard viewer
fr: Initialise les vues du presse-papiers

source: Loop until the user exits.
fr: Boucle jusqu'à ce que l'utilisateur quitte.

source: Shut down clipboard viewer
fr: Arrête les vues du presse-papiers

source: Write message to memo
fr: Ecrit un message dans le memo

source: Handle $WM_CHANGECBCHAIN messages
fr: Handle des messages $WM_CHANGECBCHAIN

source: Show that message was received
fr: Montre que le message a été reçu

source: If the next window is closing, repair the chain
fr: Si la fenêtre suivante se ferme, répare la chaîne

source: Otherwise pass the message to the next viewer
fr: Sinon passe le message à l'autre vue

source: Handle $WM_DRAWCLIPBOARD messages
fr: Handle des messages $WM_DRAWCLIPBOARD

source: Display any text on clipboard
fr: Affiche un texte du presse-papiers

source: Pass the message to the next viewer
fr: Passe le message à la vue suivante

source: Closes the clipboard
fr: Ferme le presse-papiers

source: True
fr: Retourne True

source: False
fr: Retourne False

source: When the window has finished examining or changing the clipboard close the clipboard by calling this function.
fr: Lorsque la fenêtre a fini d'examiner ou de modifier le presse-papiers, fermez le presse-papiers en appelant cette fonction.

source: This enables other windows to access the clipboard.
fr: Cela permet à d'autres fenêtres d'accéder au presse-papiers.

source: Do not place an object on the clipboard after calling this function.
fr: Ne placez pas d'objet dans le presse-papiers après l'appel de cette fonction.

source: Search CloseClipboard in MSDN Library
fr: Consultez CloseClipboard dans la Librairie MSDN.

source: Open the clipboard
fr: Ouvre le presse-papiers

source: Show clipboard formats available
fr: Affiche les formats disponibles du presse-papiers

source: Empty the clipboard
fr: Vide le presse-papiers

source: Close the clipboard
fr: Ferme le presse-papiers

source: Retrieves the number of different data formats currently on the clipboard
fr: Récupère le nombre de formats de données différents actuellement dans le presse-papiers

source: Returns the number of different data formats currently on the clipboard.
fr: Retourne le nombre de formats de données différents actuellement dans le presse-papiers.

source: Search CountClipboardFormats in MSDN Library
fr: Consultez CountClipboardFormats dans la Librairie MSDN.

source: Enumerate clipboard formats
fr: Énumére les formats du presse-papiers

source: Empties the clipboard and frees handles to data in the clipboard
fr: Vide le presse-papiers et libère les handles des données du presse-papiers

source: Before calling this function, you must open the clipboard by using the _ClipBoard_Open() function.
fr: Avant d'appeler cette fonction, vous devez ouvrir le presse-papiers en utilisant la fonction _ClipBoard_Open().

source: If you specified a NULL window handle when opening the clipboard, this function succeeds but sets the clipboard owner to NULL.
fr: Si vous avez spécifié un handle de fenêtre NULL lors de l'ouverture du presse-papiers, cette fonction réussit mais définit le propriétaire du presse-papiers comme NULL.

source: Note that this causes _ClipBoard_SetData() to fail.
fr: A noter que cela provoque l'échec de la fonction _ClipBoard_SetData().

source: Search EmptyClipboard in MSDN Library
fr: Consultez EmptyClipboard dans la Librairie MSDN.

source: Show clipboard statistics
fr: Affiche les statistiques du presse-papiers

source: Enumerates the data formats currently available on the clipboard
fr: Énumère les formats de données actuellement disponibles dans le presse-papiers

source: Specifies a clipboard format that is known to be available.
fr: Indique un format de presse-papiers qui est connu pour être disponible.

source: To start an enumeration of formats, set $iFormat to zero.
fr: Pour commencer une énumération de formats, définir $iFormat à zéro.

source: When $iFormat is zero, the function retrieves the first available clipboard format.
fr: Lorsque $iFormat est nul, la fonction récupère le premier format disponible du presse-papiers.

source: For subsequent calls during an enumeration, set $iFormat to the result of the previous call.
fr: Pour les appels suivants au cours d'une énumération, définir $iFormat avec le résultat de l'appel précédent.

source: The clipboard format that follows the specified format
fr: Retourne le format du presse-papiers qui suit le format spécifié

source: You must open the clipboard before enumerating its formats
fr: Vous devez ouvrir le presse-papiers avant d'énumérer ses formats.

source: Search EnumClipboardFormats in MSDN Library
fr: Consultez EnumClipboardFormats dans la Librairie MSDN.

source: Returns a string representation of a standard clipboard format
fr: Retourne une représentation chaîne d'un format standard de presse-papiers

source: Specifies a clipboard format
fr: Indique un format de presse-papiers

source: Returns a String representation of the clipboard format
fr: Retourne une représentation de type String d'un format de presse-papiers

source: Retrieves data from the clipboard in a specified format
fr: Récupère les données du presse-papiers dans un format spécifié

source: Specifies a clipboard format:
fr: Spécifie un format de presse-papiers:

source: $CF_TEXT - Text format
fr: $CF_TEXT - Format texte

source: $CF_BITMAP - Handle to a bitmap (HBITMAP)
fr: $CF_BITMAP - Handle d'une image bitmap (HBITMAP)

source: $CF_METAFILEPICT - Handle to a metafile picture (METAFILEPICT)
fr: $CF_METAFILEPICT - Handle d'un métafichier d'image (METAFILEPICT)

source: $CF_SYLK - Microsoft Symbolic Link (SYLK) format
fr: $CF_SYLK - Format Microsoft Symbolic Link (SYLK)

source: $CF_DIF - Software Arts' Data Interchange Format
fr: $CF_DIF - Format Data Interchange de Software Arts

source: $CF_TIFF - Tagged image file format
fr: $CF_TIFF - Format Tagged Image File

source: $CF_OEMTEXT - Text format containing characters in the OEM character set
fr: $CF_OEMTEXT - Format texte contenant des caractères dans le jeu de caractères OEM

source: $CF_DIB - BITMAPINFO structure followed by the bitmap bits
fr: $CF_DIB - Structure de BITMAPINFO suivie par les bits du bitmap

source: $CF_PALETTE - Handle to a color palette
fr: $CF_PALETTE - Handle d'une palette de couleurs

source: $CF_PENDATA - Data for the pen extensions to Pen Computing
fr: $CF_PENDATA - Données pour les extensions de crayon à Pen Computing

source: $CF_RIFF - Represents audio data in RIFF format
fr: $CF_RIFF - Représente les données audio au format RIFF

source: $CF_WAVE - Represents audio data in WAVE format
fr: $CF_WAVE - Représente les données audio au format WAVE

source: $CF_UNICODETEXT - Unicode text format
fr: $CF_UNICODETEXT - Format texte Unicode

source: $CF_ENHMETAFILE - Handle to an enhanced metafile (HENHMETAFILE)
fr: $CF_ENHMETAFILE - Handle d'un métafichier étendu (HENHMETAFILE)

source: $CF_HDROP - Handle to type HDROP that identifies a list of files
fr: $CF_HDROP - Handle d'un type HDROP qui identifie une liste de fichiers

source: $CF_LOCALE - Handle to the locale identifier associated with text in the clipboard
fr: $CF_LOCALE - Handle d'un identifiant de paramètres régionaux associés au texte du presse-papiers

source: $CF_DIBV5 - BITMAPV5HEADER structure followed by bitmap color and the bitmap bits
fr: $CF_DIBV5 - Structure BITMAPV5HEADER suivie par les couleurs du bitmap et des bits du bitmap

source: $CF_OWNERDISPLAY - Owner display format
fr: $CF_OWNERDISPLAY - Format d'affichage propriétaire

source: $CF_DSPTEXT - Text display format associated with a private format
fr: $CF_DSPTEXT - Format d'affichage de texte associé à un format privé

source: $CF_DSPBITMAP - Bitmap display format associated with a private format
fr: $CF_DSPBITMAP - Format d'affichage de bitmap associé à un format privé

source: $CF_DSPMETAFILEPICT - Metafile picture display format associated with a private format
fr: $CF_DSPMETAFILEPICT - Format d'affichage de métafichier d'image associé à un format privé

source: $CF_DSPENHMETAFILE - Enhanced metafile display format associated with a private format
fr: $CF_DSPENHMETAFILE - Format d'affichage de métafichier amélioré associé à un format privé

source: Text for text based formats or Binary data for all other formats
fr: Retourne du texte pour les formats texte ou des données binaires pour tous les autres formats

source: @extended is set to the # of characters for Text, or # of bytes for Binary
fr: @extended est définit avec le nombre de caractères du texte, ou le nombre d'octets du Binary

source: This function performs all of the steps neccesary to get data from the clipboard.
fr: Cette fonction effectue toutes les étapes nécessaire pour obtenir des données à partir du presse-papiers.

source: It checks to see if the data format is available, opens the clipboard, closes the clipboard and returns the data in one of two formats:String format for datatypes $CF_TEXT, $CF_OEMTEXT, or $CF_UNICODETEXT, or Binary format for every other type.
fr: Elle vérifie si le format de données est disponible, ouvre le presse-papiers, ferme le presse-papiers et retourne les données dans l'un des deux formats : format String pour les types de données $CF_TEXT, $CF_OEMTEXT, ou $CF_UNICODETEXT, ou format Binary pour tous les autres types.

source: If you need a finer degree of control over retrieving data from the clipboard, you may want to use the _ClipBoard_GetDataEx() function.
fr: Si vous avez besoin d'un degré de contrôle plus fin sur la récupération de données à partir du presse-papiers, vous pouvez utiliser la fonction _ClipBoard_GetDataEx().

source: Handle to a clipboard object in the specified format
fr: Retourne le handle de l'objet presse-papiers dans le format spécifié

source: The clipboard controls the handle that the _ClipBoard_GetData() function returns, not the application.
fr: Le presse-papiers contrôle le handle que la fonction _ClipBoard_GetData() retourne, pas l'application.

source: You should copy the data immediately.
fr: Vous devez copier immédiatement les données.

source: The application must not free the handle nor leave it locked.
fr: L'application ne doit pas libérer le handle ni le verrouiller.

source: The application must not use the handle after the _ClipBoard_Empty() or _ClipBoard_Close() function is called, or after the _ClipBoard_SetData() function is called with the same clipboard format.
fr: L'application ne doit pas utiliser le handle après des appels des fonctions _ClipBoard_Empty() ou _ClipBoard_Close(), or aprés l'appel de la fonction _ClipBoard_SetData() avec le même format de presse-papiers.

source: Search GetClipboardData in MSDN Library
fr: Consultez GetClipboardData dans la Librairie MSDN.

source: Read clipboard text
fr: Lit le texte du presse-papiers

source: Retrieves the name of the specified registered format
fr: Récupère le nom du format enregistré spécifié

source: Specifies the type of format to be retrieved
fr: Indique le type de format à récupérer

source: Format name
fr: Retourne le nom du format

source: Empty string
fr: Retourne une chaîne vide

source: The $iFormat parameter must not specify any of the predefined clipboard formats
fr: Le paramètre $iFormat ne doit pas spécifier l'un des formats prédéfinis du presse-papiers

source: Search GetClipboardFormatNameA in MSDN Library
fr: Consultez GetClipboardFormatNameA dans la Librairie MSDN.

source: Register a new clipboard format
fr: Crée un nouveau format de presse-papiers

source: Show new format
fr: Montre le nouveau format

source: Retrieves the handle to the window that currently has the clipboard open
fr: Récupère le handle de la fenêtre qui a actuellement le presse-papiers ouvert

source: The handle to the window that has the clipboard open
fr: Retourne le handle de la fenêtre qui a le presse-papiers ouvert

source: 0 if no window has the clipboard open
fr: Retourne 0 si aucune fenêtre n'a le presse-papiers ouvert

source: If an application or DLL specifies a NULL window handle when calling the _ClipBoard_Open() function, the clipboard is opened but is not associated with a window.
fr: Si une application ou DLL spécifie un handle de fenêtre NULL lors de l'appel de la fonction _ClipBoard_Open(), le presse-papiers est ouvert mais n'est pas associé à une fenêtre.

source: In such a case, _ClipBoard_GetOpenWindow() returns 0.
fr: Dans ce cas, _ClipBoard_GetOpenWindow() retourne 0.

source: Search GetOpenClipboardWindow in MSDN Library
fr: Consultez GetOpenClipboardWindow dans la Librairie MSDN.

source: Retrieves the window handle of the current owner of the clipboard
fr: Récupère le handle de la fenêtre du propriétaire actuel du presse-papiers

source: The handle to the window that owns the clipboard
fr: Retourne le handle de la fenêtre du propriétaire actuel du presse-papiers

source: The clipboard can still contain data even if the clipboard is not currently owned.
fr: Le presse-papiers peut encore contenir des données même si le presse-papiers n'est pas actuellement propriétaire d'une fenêtre.

source: In general, the clipboard owner is the window that last placed data in clipboard.
fr: En général, le propriétaire du presse-papiers est la fenêtre qui a placé en dernier des données dans le presse-papiers.

source: The _ClipBoard_Empty() function assigns clipboard ownership.
fr: La fonction _ClipBoard_Empty() assigne la propriété du presse-papiers.

source: Search GetClipboardOwner in MSDN Library
fr: Consultez GetClipboardOwner dans la Librairie MSDN.

source: Retrieves the first available clipboard format in the specified list
fr: Récupère le premier format disponible du presse-papiers dans la liste spécifiée

source: Array with the following format:
fr: Tableau de la forme suivante:

source: [0] - Number of formats (n)
fr: [0] - Nombre de formats (n)

source: The first clipboard format in the list for which data is available
fr: Retourne le premier format de la liste pour lequel des données sont disponibles

source: Format not found due to:
fr: Retourne la raison pour laquelle le format est introuvable:

source: -1 - Clipboard has data, but not in any of the formats requested
fr: -1 - Le presse-papiers contient des données, mais pas dans le format demandé

source: 0 - Clipboard is empty
fr: 0 - Le presse-papiers est vide

source: Search GetPriorityClipboardFormat in MSDN Library
fr: Consultez GetPriorityClipboardFormat dans la Librairie MSDN.

source: See if there is any text in the clipboard
fr: Regarde s'il y a un texte dans le presse-papiers

source: Retrieves the clipboard sequence number for the current window station
fr: Récupère le numéro de séquence du presse-papiers pour la station de fenêtre actuelle

source: The clipboard sequence number
fr: Retourne le numéro de séquence du presse-papiers

source: The system keeps a serial number for the clipboard for each window station.
fr: Le système conserve un numéro de série pour le presse-papiers pour chaque station de fenêtre.

source: This number is incremented when the contents of the clipboard change or the clipboard is emptied.
fr: Ce nombre est incrémenté lorsque le contenu du presse-papiers change ou le presse-papiers est vidé.

source: You can track this value to determine if the clipboard contents have changed and optimize creating data objects.
fr: Vous pouvez suivre cette valeur pour déterminer si le contenu du presse-papiers a changé et optimiser la création d'objets de données.

source: If clipboard rendering is delayed, the sequence number is not incremented until the changes are rendered.
fr: Si l'actualisation du presse-papiers est retardée, le numéro de séquence n'est pas incrémenté jusqu'à ce que les changements soient actualisés.

source: Search GetClipboardSequenceNumber in MSDN Library
fr: Consultez GetClipboardSequenceNumber dans la Librairie MSDN.

source: Retrieves the handle to the first window in the clipboard viewer chain
fr: Récupère la handle de la première fenêtre dans la chaîne des visualiseurs du presse-papiers

source: The handle to the first window in the clipboard viewer chain
fr: Retourne le handle de la première fenêtre dans la chaîne des visualiseurs du presse-papiers

source: 0 if there is no clipboard viewer
fr: Retourne 0 si il n'y a pas de visualiseur dans le presse-papiers

source: Search GetClipboardViewer in MSDN Library
fr: Consultez GetClipboardViewer dans la Librairie MSDN.

source: Determines whether the clipboard contains data in the specified format
fr: Détermine si le presse-papiers contient des données dans le format spécifié

source: Specifies a standard or registered clipboard format
fr: Indique un format de presse-papiers standard ou enregistré

source: True - Clipboard contains data in the specified format
fr: Retourne True - Le presse-papiers contient des données dans le format spécifié

source: False - Clipboard does not contain data in the specified format
fr: Retourne False - Le presse-papiers ne contient pas de données dans le format spécifié

source: Search IsClipboardFormatAvailable in MSDN Library
fr: Consultez IsClipboardFormatAvailable dans la Librairie MSDN.

source: Opens the clipboard and prevents other applications from modifying the clipboard
fr: Ouvre le presse-papiers et empêche d'autres applications de modifier le presse-papiers

source: Handle to the window to be associated with the open clipboard.
fr: Handle de la fenêtre qui est associée au presse-papiers ouvert.
